app/Filters/AdminFilter.php

SELECT *
FROM `users`
WHERE `id` = 3
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        if(session('id') || !session('id')){
            $id = session()->get('id');
            $adminModel = new UserModel();
            $user['admin'] = $adminModel->where('id', $id)->first();