app/Filters/UserFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        if(session('id') || !session('id')){
            $id = session()->get('id');
            $adminModel = new UserModel();
            $user['user'] = $adminModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = 4
 LIMIT 1