app/Controllers/Admin.php

    public function tampilData(){
        $data['dataExcel'] = $this->costumer->findAll();
---
SELECT *
FROM `costumers`