app/Controllers/Auth.php

    public function prosesLogin(){
        $user_data = $this->request->getVar();
        $userModel = new UserModel();



        try{
            $data['users'] = $userModel->where('username', $user_data['username'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'adminpln'
 LIMIT 1