app/Controllers/Dashboard.php

    public function show()
    {
        $data['dataExcel'] = $this->costumer->findAll();
---
SELECT *
FROM `costumers`