app/Controllers/Survey.php

SELECT *
FROM `costumers`
WHERE `id` = '1'
 LIMIT 1
---
    public function index($id)
    {
        $data['costumer'] = $this->costumer->where(['id' => $id])->first();

INSERT INTO `survey` (`NO_AGENDA`, `TGL_MOHON`, `NO_REGISTER`, `ID_PEL`, `ALAMAT`, `NO_TELP`, `DAYA`, `PANJANG_KABEL_SR`, `NAMA_SURVEYOR`, `TGL_SURVEY`, `created_at`, `updated_at`) VALUES ('2147483647', '2021-07-27', '0', '2147483647', 'walanga', '112313', 'R-1/TR', '1', 'alif', '2022-07-03', '2022-07-03 04:51:30', '2022-07-03 04:51:30')
---
    public function proses()
    {
        $data = $this->request->getVar();
        try{
            $this->survey->insert($data);

SELECT *
FROM `survey`
---
    public function show(){
        $data['costumer'] = $this->survey->findAll();